testFiles/results_one_thread_6GB_bench/memtier_oomd_yes_throttle.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 101%,  40 secs]  0 threads:       41218 ops,    1123 (avg:    1025) ops/sec, 991.87MB/sec (avg: 746.39MB/sec), 432.77 (avg: 487.70) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           93.29          ---          ---       508.32878       511.99900       634.87900       675.83900    764264.60 
Gets          928.48         0.00       928.48       485.62906       532.47900       663.55100       745.47100        36.18 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1021.78         0.00       928.48       487.69483       532.47900       659.45500       745.47100    764300.78 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET     149.503        0.000
SET     405.503        5.000
SET     440.319       10.000
SET     464.895       15.000
SET     475.135       20.000
SET     481.279       25.000
SET     489.471       30.000
SET     495.615       35.000
SET     501.759       40.000
SET     505.855       45.000
SET     511.999       50.000
SET     516.095       52.500
SET     518.143       55.000
SET     520.191       57.500
SET     524.287       60.000
SET     528.383       62.500
SET     528.383       65.000
SET     532.479       67.500
SET     536.575       70.000
SET     540.671       72.500
SET     544.767       75.000
SET     544.767       76.250
SET     548.863       77.500
SET     548.863       78.750
SET     552.959       80.000
SET     552.959       81.250
SET     557.055       82.500
SET     557.055       83.750
SET     561.151       85.000
SET     565.247       86.250
SET     569.343       87.500
SET     569.343       88.125
SET     573.439       88.750
SET     573.439       89.375
SET     577.535       90.000
SET     577.535       90.625
SET     581.631       91.250
SET     585.727       91.875
SET     585.727       92.500
SET     589.823       93.125
SET     593.919       93.750
SET     593.919       94.062
SET     598.015       94.375
SET     598.015       94.688
SET     598.015       95.000
SET     602.111       95.312
SET     602.111       95.625
SET     606.207       95.938
SET     606.207       96.250
SET     610.303       96.562
SET     610.303       96.875
SET     614.399       97.031
SET     614.399       97.188
SET     614.399       97.344
SET     618.495       97.500
SET     618.495       97.656
SET     618.495       97.812
SET     622.591       97.969
SET     622.591       98.125
SET     622.591       98.281
SET     626.687       98.438
SET     626.687       98.516
SET     626.687       98.594
SET     630.783       98.672
SET     630.783       98.750
SET     630.783       98.828
SET     630.783       98.906
SET     634.879       98.984
SET     634.879       99.062
SET     634.879       99.141
SET     638.975       99.219
SET     638.975       99.258
SET     638.975       99.297
SET     643.071       99.336
SET     647.167       99.375
SET     647.167       99.414
SET     651.263       99.453
SET     651.263       99.492
SET     655.359       99.531
SET     655.359       99.570
SET     659.455       99.609
SET     663.551       99.629
SET     663.551       99.648
SET     663.551       99.668
SET     663.551       99.688
SET     663.551       99.707
SET     663.551       99.727
SET     667.647       99.746
SET     667.647       99.766
SET     667.647       99.785
SET     671.743       99.805
SET     671.743       99.814
SET     671.743       99.824
SET     671.743       99.834
SET     675.839       99.844
SET     675.839       99.854
SET     675.839       99.863
SET     675.839       99.873
SET     675.839       99.883
SET     675.839       99.893
SET     675.839       99.902
SET     675.839       99.907
SET     675.839       99.912
SET     675.839       99.917
SET     684.031       99.922
SET     684.031       99.927
SET     684.031       99.932
SET     684.031       99.937
SET     684.031       99.941
SET     684.031       99.946
SET     684.031       99.951
SET     684.031       99.954
SET     684.031       99.956
SET     684.031       99.958
SET     684.031       99.961
SET     684.031       99.963
SET     684.031       99.966
SET     684.031       99.968
SET     684.031       99.971
SET     684.031       99.973
SET     692.223       99.976
SET     692.223      100.000
---
GET       0.303        0.000
GET      60.159        5.000
GET     259.071       10.000
GET     428.031       15.000
GET     462.847       20.000
GET     481.279       25.000
GET     495.615       30.000
GET     507.903       35.000
GET     518.143       40.000
GET     524.287       45.000
GET     532.479       50.000
GET     536.575       52.500
GET     540.671       55.000
GET     544.767       57.500
GET     548.863       60.000
GET     552.959       62.500
GET     557.055       65.000
GET     561.151       67.500
GET     561.151       70.000
GET     565.247       72.500
GET     569.343       75.000
GET     573.439       76.250
GET     573.439       77.500
GET     577.535       78.750
GET     577.535       80.000
GET     581.631       81.250
GET     581.631       82.500
GET     585.727       83.750
GET     589.823       85.000
GET     589.823       86.250
GET     593.919       87.500
GET     598.015       88.125
GET     598.015       88.750
GET     602.111       89.375
GET     602.111       90.000
GET     606.207       90.625
GET     606.207       91.250
GET     610.303       91.875
GET     610.303       92.500
GET     614.399       93.125
GET     618.495       93.750
GET     618.495       94.062
GET     618.495       94.375
GET     618.495       94.688
GET     622.591       95.000
GET     622.591       95.312
GET     626.687       95.625
GET     626.687       95.938
GET     626.687       96.250
GET     630.783       96.562
GET     630.783       96.875
GET     630.783       97.031
GET     634.879       97.188
GET     634.879       97.344
GET     634.879       97.500
GET     634.879       97.656
GET     638.975       97.812
GET     638.975       97.969
GET     638.975       98.125
GET     643.071       98.281
GET     647.167       98.438
GET     647.167       98.516
GET     647.167       98.594
GET     651.263       98.672
GET     651.263       98.750
GET     655.359       98.828
GET     659.455       98.906
GET     663.551       98.984
GET     663.551       99.062
GET     667.647       99.141
GET     671.743       99.219
GET     675.839       99.258
GET     675.839       99.297
GET     679.935       99.336
GET     679.935       99.375
GET     679.935       99.414
GET     684.031       99.453
GET     688.127       99.492
GET     688.127       99.531
GET     692.223       99.570
GET     696.319       99.609
GET     700.415       99.629
GET     700.415       99.648
GET     700.415       99.668
GET     704.511       99.688
GET     708.607       99.707
GET     712.703       99.727
GET     712.703       99.746
GET     716.799       99.766
GET     720.895       99.785
GET     720.895       99.805
GET     724.991       99.814
GET     724.991       99.824
GET     729.087       99.834
GET     729.087       99.844
GET     729.087       99.854
GET     733.183       99.863
GET     733.183       99.873
GET     745.471       99.883
GET     745.471       99.893
GET     745.471       99.902
GET     753.663       99.907
GET     753.663       99.912
GET     753.663       99.917
GET     753.663       99.922
GET     753.663       99.927
GET     761.855       99.932
GET     761.855       99.937
GET     761.855       99.941
GET     761.855       99.946
GET     761.855       99.951
GET     770.047       99.954
GET     770.047       99.956
GET     770.047       99.958
GET     770.047       99.961
GET     770.047       99.963
GET     770.047       99.966
GET     770.047       99.968
GET     770.047       99.971
GET     770.047       99.973
GET     770.047       99.976
GET     794.623       99.977
GET     794.623      100.000
---
WAIT      0.000      100.000